# 동서방향 거리를 구하는 식과 남북방향거리를 구하는 식을 구해야 한다. 
# 동서방향 거리는 일단 각각의 입력된 두개의 숫자에서 4를 // 나누기 하였을때 몫에서 나머지가 있다면 +1 아니라면 그냥 몫이 열의 위치이고 두개의 값 중 큰 값에서 작은 값을 빼기 
# 남북방향 거리는 일단 각각의 입력된 숫자에서 4를 // 나누기 하였을때 몫에서 나머지가 0 이라면 4 이고 아니라면 나머지 값이 행의 위치이고 두개의 값 중 큰 값에서 작은 값을 뺴기 
# 그럼 나온 두 값을 더하면 두개의 자연수 사이의 직각거리이다. 
x = list(map(int,input().split())) # 두개의 자연수 값을 리스트로 입력해 이 리스트를 각각 숫자의 열의 위치를 저장하는 용도로 사용 
y = [] # 각각 숫자의 행의 위치를 저장 
for i in range(2):
    if x[i]%4 > 0 :
        y.append(x[i]%4) # 나머지가 0보다 크다면 나머지 저장 (행)
        x[i] = x[i]//4 + 1 # 나머지가 0보다 크다면 몫과 함꼐 +1 로 저장 (열)
    elif x[i]%4 == 0:
        x[i] = x[i]//4 # 나머지가 0이면 몫만 저장 (열)
        y.append(4) # 나머지가 0이면 4를 저장 (행)
print(abs(x[0]-x[1])+ abs(y[0]-y[1])) # x 리스트 원소들끼리의 계산은 동서방향 거리, y 리스트 원소들끼리의 계산은 남북방향 거리 

