# 일단 완전 제곱근으로 구성된 리스트를 만들어야 함. 
a = int(input())
b = int(input())
x = [] # 1~10000까지 가능한 모든 완전 제곱식을 x 리스트에 저장 
y = [] # 입력되는 두개의 정수 사이의 값 중 완전 제곱식에 포합 되는 값을 y 리스트에 저장 
for i in range(1,10001):
    for j in range(1,10001): # 프로그램을 돌려보니 이런식으로까지 큰 리스트를 만들 필요가 없음. 매우 비효율적임. 
        if i==j:
            if (i*j) <= b:
                x.append(i*j) # 입력한 범위까지의 완전 제곱식만 x 리스트에 저장 후 그 값을 넘어가면 프로그램 빠져나오기. 
            else:
                break
# 이제 이 리스트를 입력되는 두개의 정수 사이의 값이 이 리스트에 있는지 찾고 그 값을 또 다른 리스트로 만든다. 

# 이 두개의 값을 range 로 해서 하나씪 for 문을 통해 확인 한다. 
for i in range(a,b+1):
    if i in x:
        y.append(i)

if y != []:
    print(sum(y)) # 리스트의 모든 값을 더하고 그 값을 출력 
    print(min(y)) # 리스트의 최소값을 출력 
else:
    print(-1) # 리스트가 비어 있다면 -1 을 출력


