n = input()
m = 0
count = 0
# 일단 두가지 아이디어가 생각난다. 
# 첫번째, 기존에 입력되는 문자열을 리스트화 시켜 reverse 함수를 이용해서 뒤집어버린 문자열과 같은지 비교하는 아이디어
# 두번째, 결국 뒤집으면 문자열의 개수가 홀수면 가장 중앙에 있는 문자열은 항상 같아야 할것이고 맨처음 문자열과 
# 맨 끝 문자열이 같아야 하고 그리고 앞에 문자는 +1 뒤에 문자는 -1 하면서 같은지 비교하면 될 것 같고 
# 만약 문자열의 개수가 짝수이면 중앙에 있는 문자는 없고 나머지 홀수 문자열을 판단하는 방법과 같은 방법으로 판단하면 되는 아이디어
# 첫번째 방법이 효율적이라고 생각함. 
x = list(n)
y = list(n)
y.reverse()
while m < len(x) : 
    if x[m] == y[m]:
        m+=1
        count+=1
    else:
        count = 0
        m+=1
if count == len(x):
    print(1)
else:
    print(0)
